let m_instance = null;

class Model {
  constructor() {
    if (m_instance) return m_instance;
    // imitation of database
    this.database = [
      [[49.58038823659895, 34.55365036385336], 'Чудова общага', 1],
      [[49.58171916060577, 34.568390876747415], 'Котляревський Іван Петрович', 2],
      [[49.31258046588784, 34.33675080420506], 'Борис Олійник', 3],
      [[49.45734900083983, 33.03018375609924], 'Микола Лисенко', 4],
      [[50.37099285287813, 33.99377326605973], 'Олена Пчілка', 5],
      [[49.08169939707607, 34.07241346731596], 'Олесь Гончар', 6],
      [[49.960821261063096, 33.604536968885014], 'Панас Мирний', 7],
      [[49.12966360745952, 35.09226861323055], 'Діма Пупсик', 8],
    ];

    m_instance = this;
  }
}
